ARMmbed/DAPLink/source/hic_hal/nxp/lpc55xx/LPC55S69/drivers/fsl_usart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart11_non_blocking_driver_state")
cmsis_usart_non_blocking_driver_state_t usart11_NonBlockingDriverState = {
#else
cmsis_usart_non_blocking_driver_state_t usart11_NonBlockingDriverState = {
#endif
    &usart11_Resource,
    &USART11_Handle,
};

static int32_t USART11_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    USART11_InitPins();
    return USART_NonBlockingInitialize(cb_event, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingUninitialize(void)
{
    USART11_DeinitPins();
    return USART_NonBlockingUninitialize(&usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart11_NonBlockingDriverState);
#if defined(USART11_RX_BUFFER_ENABLE) && (USART11_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart11_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart11_NonBlockingDriverState.resource->base,
                                      usart11_NonBlockingDriverState.handle, usart11_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART11_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart11_NonBlockingDriverState);
}

static uint32_t USART11_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart11_NonBlockingDriverState);
}

static uint32_t USART11_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart11_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART11_RX_BUFFER_ENABLE) && (USART11_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart11_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART11_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart11_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART11 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART11_DMA_EN
    USART11_DmaInitialize,  USART11_DmaUninitialize, USART11_DmaPowerControl, USART11_DmaSend,    USART11_DmaReceive,
    USART11_DmaTransfer,    USART11_DmaGetTxCount,   USART11_DmaGetRxCount,   USART11_DmaControl, USART11_DmaGetStatus,
#else
    USART11_NonBlockingInitialize,
    USART11_NonBlockingUninitialize,
    USART11_NonBlockingPowerControl,
    USART11_NonBlockingSend,
    USART11_NonBlockingReceive,
    USART11_NonBlockingTransfer,
    USART11_NonBlockingGetTxCount,
    USART11_NonBlockingGetRxCount,
    USART11_NonBlockingControl,
    USART11_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart11 */

#if defined(USART12) && RTE_USART12

/* User needs to provide the implementation for USART12_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t USART12_GetFreq(void);
extern void USART12_InitPins(void);
extern void USART12_DeinitPins(void);

cmsis_usart_resource_t usart12_Resource = {USART12, USART12_GetFreq};

#if RTE_USART12_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_usart_dma_resource_t usart12_DmaResource = {
    RTE_USART12_DMA_TX_DMA_BASE,
    RTE_USART12_DMA_TX_CH,
    RTE_USART12_DMA_RX_DMA_BASE,
    RTE_USART12_DMA_RX_CH,
};

usart_dma_handle_t USART12_DmaHandle;
dma_handle_t USART12_DmaRxHandle;
dma_handle_t USART12_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart12_dma_driver_state")
cmsis_usart_dma_driver_state_t usart12_DmaDriverState = {
#else
cmsis_usart_dma_driver_state_t usart12_DmaDriverState = {
#endif
    &usart12_Resource, &usart12_DmaResource, &USART12_DmaHandle, &USART12_DmaRxHandle, &USART12_DmaTxHandle,
};

static int32_t USART12_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    USART12_InitPins();
    return USART_DmaInitialize(cb_event, &usart12_DmaDriverState);
}

static int32_t USART12_DmaUninitialize(void)
{
    USART12_DeinitPins();
    return USART_DmaUninitialize(&usart12_DmaDriverState);
}

static int32_t USART12_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart12_DmaDriverState);
}

static int32_t USART12_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart12_DmaDriverState);
}

static int32_t USART12_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart12_DmaDriverState);
}

static int32_t USART12_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart12_DmaDriverState);
}

static uint32_t USART12_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart12_DmaDriverState);
}

static uint32_t USART12_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart12_DmaDriverState);
}

static int32_t USART12_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart12_DmaDriverState);
}

static ARM_USART_STATUS USART12_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart12_DmaDriverState);
}

#endif

#else

usart_handle_t USART12_Handle;
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
static uint8_t usart12_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

