ARMmbed/DAPLink/source/hic_hal/nxp/lpc55xx/LPC55S69/drivers/fsl_usart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart12_non_blocking_driver_state")
cmsis_usart_non_blocking_driver_state_t usart12_NonBlockingDriverState = {
#else
cmsis_usart_non_blocking_driver_state_t usart12_NonBlockingDriverState = {
#endif
    &usart12_Resource,
    &USART12_Handle,
};

static int32_t USART12_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    USART12_InitPins();
    return USART_NonBlockingInitialize(cb_event, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingUninitialize(void)
{
    USART12_DeinitPins();
    return USART_NonBlockingUninitialize(&usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart12_NonBlockingDriverState);
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart12_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart12_NonBlockingDriverState.resource->base,
                                      usart12_NonBlockingDriverState.handle, usart12_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART12_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart12_NonBlockingDriverState);
}

static uint32_t USART12_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart12_NonBlockingDriverState);
}

static uint32_t USART12_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart12_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart12_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART12_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart12_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART12 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART12_DMA_EN
    USART12_DmaInitialize,  USART12_DmaUninitialize, USART12_DmaPowerControl, USART12_DmaSend,    USART12_DmaReceive,
    USART12_DmaTransfer,    USART12_DmaGetTxCount,   USART12_DmaGetRxCount,   USART12_DmaControl, USART12_DmaGetStatus,
#else
    USART12_NonBlockingInitialize,
    USART12_NonBlockingUninitialize,
    USART12_NonBlockingPowerControl,
    USART12_NonBlockingSend,
    USART12_NonBlockingReceive,
    USART12_NonBlockingTransfer,
    USART12_NonBlockingGetTxCount,
    USART12_NonBlockingGetRxCount,
    USART12_NonBlockingControl,
    USART12_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart12 */

#if defined(USART13) && RTE_USART13

/* User needs to provide the implementation for USART13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t USART13_GetFreq(void);
extern void USART13_InitPins(void);
extern void USART13_DeinitPins(void);

cmsis_usart_resource_t usart13_Resource = {USART13, USART13_GetFreq};

#if RTE_USART13_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_usart_dma_resource_t usart13_DmaResource = {
    RTE_USART13_DMA_TX_DMA_BASE,
    RTE_USART13_DMA_TX_CH,
    RTE_USART13_DMA_RX_DMA_BASE,
    RTE_USART13_DMA_RX_CH,
};

usart_dma_handle_t USART13_DmaHandle;
dma_handle_t USART13_DmaRxHandle;
dma_handle_t USART13_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart13_dma_driver_state")
cmsis_usart_dma_driver_state_t usart13_DmaDriverState = {
#else
cmsis_usart_dma_driver_state_t usart13_DmaDriverState = {
#endif
    &usart13_Resource, &usart13_DmaResource, &USART13_DmaHandle, &USART13_DmaRxHandle, &USART13_DmaTxHandle,
};

static int32_t USART13_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    USART13_InitPins();
    return USART_DmaInitialize(cb_event, &usart13_DmaDriverState);
}

static int32_t USART13_DmaUninitialize(void)
{
    USART13_DeinitPins();
    return USART_DmaUninitialize(&usart13_DmaDriverState);
}

static int32_t USART13_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart13_DmaDriverState);
}

static int32_t USART13_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart13_DmaDriverState);
}

static int32_t USART13_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart13_DmaDriverState);
}

static int32_t USART13_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart13_DmaDriverState);
}

static uint32_t USART13_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart13_DmaDriverState);
}

static uint32_t USART13_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart13_DmaDriverState);
}

static int32_t USART13_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart13_DmaDriverState);
}

static ARM_USART_STATUS USART13_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart13_DmaDriverState);
}

#endif

#else

usart_handle_t USART13_Handle;
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
static uint8_t usart13_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

