ARMmbed/DAPLink/source/hic_hal/nxp/lpc55xx/LPC55S69/drivers/fsl_usart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart13_non_blocking_driver_state")
cmsis_usart_non_blocking_driver_state_t usart13_NonBlockingDriverState = {
#else
cmsis_usart_non_blocking_driver_state_t usart13_NonBlockingDriverState = {
#endif
    &usart13_Resource,
    &USART13_Handle,
};

static int32_t USART13_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    USART13_InitPins();
    return USART_NonBlockingInitialize(cb_event, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingUninitialize(void)
{
    USART13_DeinitPins();
    return USART_NonBlockingUninitialize(&usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart13_NonBlockingDriverState);
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart13_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart13_NonBlockingDriverState.resource->base,
                                      usart13_NonBlockingDriverState.handle, usart13_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART13_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart13_NonBlockingDriverState);
}

static uint32_t USART13_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart13_NonBlockingDriverState);
}

static uint32_t USART13_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart13_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart13_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART13_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart13_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART13 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART13_DMA_EN
    USART13_DmaInitialize,  USART13_DmaUninitialize, USART13_DmaPowerControl, USART13_DmaSend,    USART13_DmaReceive,
    USART13_DmaTransfer,    USART13_DmaGetTxCount,   USART13_DmaGetRxCount,   USART13_DmaControl, USART13_DmaGetStatus,
#else
    USART13_NonBlockingInitialize,
    USART13_NonBlockingUninitialize,
    USART13_NonBlockingPowerControl,
    USART13_NonBlockingSend,
    USART13_NonBlockingReceive,
    USART13_NonBlockingTransfer,
    USART13_NonBlockingGetTxCount,
    USART13_NonBlockingGetRxCount,
    USART13_NonBlockingControl,
    USART13_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart13 */
